{"format": "graph-model", "generatedBy": "2.4.4", "convertedBy": "TensorFlow.js Converter v3.18.0", "signature": {"inputs": {"conv1d_16_input": {"name": "conv1d_16_input:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "60"}, {"size": "1"}]}}}, "outputs": {"dense_5": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "5"}]}}}}, "modelTopology": {"node": [{"name": "StatefulPartitionedCall/sequential_2/conv1d_16/Pad/paddings", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}, {"size": "2"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_2/conv1d_16/conv1d/ExpandDims/dim", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_2/conv1d_16/conv1d/ExpandDims_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "7"}, {"size": "1"}, {"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_2/conv1d_16/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_2/conv1d_17/Pad/paddings", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}, {"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_2/conv1d_17/conv1d/ExpandDims/dim", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/sequential_2/conv1d_17/conv1d/ExpandDims_1", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "7"}, {"size": "32"}, {"size": "32"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_2/conv1d_17/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_2/max_pooling1d_8/ExpandDims/dim", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/sequential_2/conv1d_18/Pad/paddings", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}, {"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_2/conv1d_18/conv1d/ExpandDims/dim", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_2/conv1d_18/conv1d/ExpandDims_1", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "7"}, {"size": "32"}, {"size": "64"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_2/conv1d_18/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_2/conv1d_19/Pad/paddings", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}, {"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_2/conv1d_19/conv1d/ExpandDims/dim", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/sequential_2/conv1d_19/conv1d/ExpandDims_1", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "7"}, {"size": "64"}, {"size": "64"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_2/conv1d_19/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_2/max_pooling1d_9/ExpandDims/dim", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/sequential_2/conv1d_20/Pad/paddings", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}, {"size": "2"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_2/conv1d_20/conv1d/ExpandDims/dim", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/sequential_2/conv1d_20/conv1d/ExpandDims_1", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "7"}, {"size": "64"}, {"size": "128"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_2/conv1d_20/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_2/conv1d_21/Pad/paddings", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}, {"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_2/conv1d_21/conv1d/ExpandDims/dim", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_2/conv1d_21/conv1d/ExpandDims_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "7"}, {"size": "128"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_2/conv1d_21/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_2/max_pooling1d_10/ExpandDims/dim", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_2/conv1d_22/Pad/paddings", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}, {"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_2/conv1d_22/conv1d/ExpandDims/dim", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_2/conv1d_22/conv1d/ExpandDims_1", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "7"}, {"size": "128"}, {"size": "256"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_2/conv1d_22/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_2/conv1d_23/Pad/paddings", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}, {"size": "2"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_2/conv1d_23/conv1d/ExpandDims/dim", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/sequential_2/conv1d_23/conv1d/ExpandDims_1", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "7"}, {"size": "256"}, {"size": "256"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_2/conv1d_23/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_2/max_pooling1d_11/ExpandDims/dim", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/sequential_2/flatten_2/Const", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_2/dense_4/MatMul/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "768"}, {"size": "512"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_2/dense_4/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_2/dense_5/MatMul/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}, {"size": "5"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_2/dense_5/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "5"}]}}}}}, {"name": "conv1d_16_input", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}, {"size": "60"}, {"size": "1"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_2/conv1d_16/Pad", "op": "Pad", "input": ["conv1d_16_input", "StatefulPartitionedCall/sequential_2/conv1d_16/Pad/paddings"], "attr": {"Tpaddings": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_2/conv1d_16/conv1d/ExpandDims", "op": "ExpandDims", "input": ["StatefulPartitionedCall/sequential_2/conv1d_16/Pad", "StatefulPartitionedCall/sequential_2/conv1d_16/conv1d/ExpandDims/dim"], "attr": {"Tdim": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_2/conv1d_16/conv1d", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/sequential_2/conv1d_16/conv1d/ExpandDims", "StatefulPartitionedCall/sequential_2/conv1d_16/conv1d/ExpandDims_1", "StatefulPartitionedCall/sequential_2/conv1d_16/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "use_cudnn_on_gpu": {"b": true}, "epsilon": {"f": 0.0}, "padding": {"s": "VkFMSUQ="}, "data_format": {"s": "TkhXQw=="}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "num_args": {"i": "1"}, "explicit_paddings": {"list": {}}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/sequential_2/conv1d_16/BiasAdd", "op": "Squeeze", "input": ["StatefulPartitionedCall/sequential_2/conv1d_16/conv1d"], "attr": {"squeeze_dims": {"list": {"i": ["-3"]}}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_2/conv1d_16/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/sequential_2/conv1d_16/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_2/conv1d_17/Pad", "op": "Pad", "input": ["StatefulPartitionedCall/sequential_2/conv1d_16/Relu", "StatefulPartitionedCall/sequential_2/conv1d_17/Pad/paddings"], "attr": {"T": {"type": "DT_FLOAT"}, "Tpaddings": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_2/conv1d_17/conv1d/ExpandDims", "op": "ExpandDims", "input": ["StatefulPartitionedCall/sequential_2/conv1d_17/Pad", "StatefulPartitionedCall/sequential_2/conv1d_17/conv1d/ExpandDims/dim"], "attr": {"Tdim": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_2/conv1d_17/conv1d", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/sequential_2/conv1d_17/conv1d/ExpandDims", "StatefulPartitionedCall/sequential_2/conv1d_17/conv1d/ExpandDims_1", "StatefulPartitionedCall/sequential_2/conv1d_17/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"use_cudnn_on_gpu": {"b": true}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "epsilon": {"f": 0.0}, "explicit_paddings": {"list": {}}, "num_args": {"i": "1"}, "T": {"type": "DT_FLOAT"}, "padding": {"s": "VkFMSUQ="}}}, {"name": "StatefulPartitionedCall/sequential_2/conv1d_17/BiasAdd", "op": "Squeeze", "input": ["StatefulPartitionedCall/sequential_2/conv1d_17/conv1d"], "attr": {"squeeze_dims": {"list": {"i": ["-3"]}}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_2/conv1d_17/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/sequential_2/conv1d_17/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_2/max_pooling1d_8/ExpandDims", "op": "ExpandDims", "input": ["StatefulPartitionedCall/sequential_2/conv1d_17/Relu", "StatefulPartitionedCall/sequential_2/max_pooling1d_8/ExpandDims/dim"], "attr": {"T": {"type": "DT_FLOAT"}, "Tdim": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_2/max_pooling1d_8/MaxPool", "op": "MaxPool", "input": ["StatefulPartitionedCall/sequential_2/max_pooling1d_8/ExpandDims"], "attr": {"ksize": {"list": {"i": ["1", "2", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}, "padding": {"s": "VkFMSUQ="}, "explicit_paddings": {"list": {}}, "strides": {"list": {"i": ["1", "2", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/sequential_2/max_pooling1d_8/Squeeze", "op": "Squeeze", "input": ["StatefulPartitionedCall/sequential_2/max_pooling1d_8/MaxPool"], "attr": {"squeeze_dims": {"list": {"i": ["2"]}}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_2/conv1d_18/Pad", "op": "Pad", "input": ["StatefulPartitionedCall/sequential_2/max_pooling1d_8/Squeeze", "StatefulPartitionedCall/sequential_2/conv1d_18/Pad/paddings"], "attr": {"T": {"type": "DT_FLOAT"}, "Tpaddings": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_2/conv1d_18/conv1d/ExpandDims", "op": "ExpandDims", "input": ["StatefulPartitionedCall/sequential_2/conv1d_18/Pad", "StatefulPartitionedCall/sequential_2/conv1d_18/conv1d/ExpandDims/dim"], "attr": {"Tdim": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_2/conv1d_18/conv1d", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/sequential_2/conv1d_18/conv1d/ExpandDims", "StatefulPartitionedCall/sequential_2/conv1d_18/conv1d/ExpandDims_1", "StatefulPartitionedCall/sequential_2/conv1d_18/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"data_format": {"s": "TkhXQw=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "explicit_paddings": {"list": {}}, "T": {"type": "DT_FLOAT"}, "padding": {"s": "VkFMSUQ="}, "use_cudnn_on_gpu": {"b": true}}}, {"name": "StatefulPartitionedCall/sequential_2/conv1d_18/BiasAdd", "op": "Squeeze", "input": ["StatefulPartitionedCall/sequential_2/conv1d_18/conv1d"], "attr": {"squeeze_dims": {"list": {"i": ["-3"]}}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_2/conv1d_18/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/sequential_2/conv1d_18/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_2/conv1d_19/Pad", "op": "Pad", "input": ["StatefulPartitionedCall/sequential_2/conv1d_18/Relu", "StatefulPartitionedCall/sequential_2/conv1d_19/Pad/paddings"], "attr": {"Tpaddings": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_2/conv1d_19/conv1d/ExpandDims", "op": "ExpandDims", "input": ["StatefulPartitionedCall/sequential_2/conv1d_19/Pad", "StatefulPartitionedCall/sequential_2/conv1d_19/conv1d/ExpandDims/dim"], "attr": {"T": {"type": "DT_FLOAT"}, "Tdim": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_2/conv1d_19/conv1d", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/sequential_2/conv1d_19/conv1d/ExpandDims", "StatefulPartitionedCall/sequential_2/conv1d_19/conv1d/ExpandDims_1", "StatefulPartitionedCall/sequential_2/conv1d_19/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"explicit_paddings": {"list": {}}, "num_args": {"i": "1"}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "epsilon": {"f": 0.0}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "data_format": {"s": "TkhXQw=="}, "padding": {"s": "VkFMSUQ="}}}, {"name": "StatefulPartitionedCall/sequential_2/conv1d_19/BiasAdd", "op": "Squeeze", "input": ["StatefulPartitionedCall/sequential_2/conv1d_19/conv1d"], "attr": {"T": {"type": "DT_FLOAT"}, "squeeze_dims": {"list": {"i": ["-3"]}}}}, {"name": "StatefulPartitionedCall/sequential_2/conv1d_19/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/sequential_2/conv1d_19/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_2/max_pooling1d_9/ExpandDims", "op": "ExpandDims", "input": ["StatefulPartitionedCall/sequential_2/conv1d_19/Relu", "StatefulPartitionedCall/sequential_2/max_pooling1d_9/ExpandDims/dim"], "attr": {"Tdim": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_2/max_pooling1d_9/MaxPool", "op": "MaxPool", "input": ["StatefulPartitionedCall/sequential_2/max_pooling1d_9/ExpandDims"], "attr": {"data_format": {"s": "TkhXQw=="}, "explicit_paddings": {"list": {}}, "strides": {"list": {"i": ["1", "2", "1", "1"]}}, "ksize": {"list": {"i": ["1", "2", "1", "1"]}}, "padding": {"s": "VkFMSUQ="}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_2/max_pooling1d_9/Squeeze", "op": "Squeeze", "input": ["StatefulPartitionedCall/sequential_2/max_pooling1d_9/MaxPool"], "attr": {"squeeze_dims": {"list": {"i": ["2"]}}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_2/conv1d_20/Pad", "op": "Pad", "input": ["StatefulPartitionedCall/sequential_2/max_pooling1d_9/Squeeze", "StatefulPartitionedCall/sequential_2/conv1d_20/Pad/paddings"], "attr": {"Tpaddings": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_2/conv1d_20/conv1d/ExpandDims", "op": "ExpandDims", "input": ["StatefulPartitionedCall/sequential_2/conv1d_20/Pad", "StatefulPartitionedCall/sequential_2/conv1d_20/conv1d/ExpandDims/dim"], "attr": {"T": {"type": "DT_FLOAT"}, "Tdim": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_2/conv1d_20/conv1d", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/sequential_2/conv1d_20/conv1d/ExpandDims", "StatefulPartitionedCall/sequential_2/conv1d_20/conv1d/ExpandDims_1", "StatefulPartitionedCall/sequential_2/conv1d_20/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"strides": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "padding": {"s": "VkFMSUQ="}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "explicit_paddings": {"list": {}}, "num_args": {"i": "1"}}}, {"name": "StatefulPartitionedCall/sequential_2/conv1d_20/BiasAdd", "op": "Squeeze", "input": ["StatefulPartitionedCall/sequential_2/conv1d_20/conv1d"], "attr": {"squeeze_dims": {"list": {"i": ["-3"]}}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_2/conv1d_20/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/sequential_2/conv1d_20/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_2/conv1d_21/Pad", "op": "Pad", "input": ["StatefulPartitionedCall/sequential_2/conv1d_20/Relu", "StatefulPartitionedCall/sequential_2/conv1d_21/Pad/paddings"], "attr": {"Tpaddings": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_2/conv1d_21/conv1d/ExpandDims", "op": "ExpandDims", "input": ["StatefulPartitionedCall/sequential_2/conv1d_21/Pad", "StatefulPartitionedCall/sequential_2/conv1d_21/conv1d/ExpandDims/dim"], "attr": {"T": {"type": "DT_FLOAT"}, "Tdim": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_2/conv1d_21/conv1d", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/sequential_2/conv1d_21/conv1d/ExpandDims", "StatefulPartitionedCall/sequential_2/conv1d_21/conv1d/ExpandDims_1", "StatefulPartitionedCall/sequential_2/conv1d_21/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"padding": {"s": "VkFMSUQ="}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "epsilon": {"f": 0.0}, "num_args": {"i": "1"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "use_cudnn_on_gpu": {"b": true}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}}}, {"name": "StatefulPartitionedCall/sequential_2/conv1d_21/BiasAdd", "op": "Squeeze", "input": ["StatefulPartitionedCall/sequential_2/conv1d_21/conv1d"], "attr": {"T": {"type": "DT_FLOAT"}, "squeeze_dims": {"list": {"i": ["-3"]}}}}, {"name": "StatefulPartitionedCall/sequential_2/conv1d_21/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/sequential_2/conv1d_21/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_2/max_pooling1d_10/ExpandDims", "op": "ExpandDims", "input": ["StatefulPartitionedCall/sequential_2/conv1d_21/Relu", "StatefulPartitionedCall/sequential_2/max_pooling1d_10/ExpandDims/dim"], "attr": {"T": {"type": "DT_FLOAT"}, "Tdim": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_2/max_pooling1d_10/MaxPool", "op": "MaxPool", "input": ["StatefulPartitionedCall/sequential_2/max_pooling1d_10/ExpandDims"], "attr": {"strides": {"list": {"i": ["1", "2", "1", "1"]}}, "ksize": {"list": {"i": ["1", "2", "1", "1"]}}, "explicit_paddings": {"list": {}}, "padding": {"s": "VkFMSUQ="}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}}}, {"name": "StatefulPartitionedCall/sequential_2/max_pooling1d_10/Squeeze", "op": "Squeeze", "input": ["StatefulPartitionedCall/sequential_2/max_pooling1d_10/MaxPool"], "attr": {"T": {"type": "DT_FLOAT"}, "squeeze_dims": {"list": {"i": ["2"]}}}}, {"name": "StatefulPartitionedCall/sequential_2/conv1d_22/Pad", "op": "Pad", "input": ["StatefulPartitionedCall/sequential_2/max_pooling1d_10/Squeeze", "StatefulPartitionedCall/sequential_2/conv1d_22/Pad/paddings"], "attr": {"Tpaddings": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_2/conv1d_22/conv1d/ExpandDims", "op": "ExpandDims", "input": ["StatefulPartitionedCall/sequential_2/conv1d_22/Pad", "StatefulPartitionedCall/sequential_2/conv1d_22/conv1d/ExpandDims/dim"], "attr": {"Tdim": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_2/conv1d_22/conv1d", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/sequential_2/conv1d_22/conv1d/ExpandDims", "StatefulPartitionedCall/sequential_2/conv1d_22/conv1d/ExpandDims_1", "StatefulPartitionedCall/sequential_2/conv1d_22/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"explicit_paddings": {"list": {}}, "num_args": {"i": "1"}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "epsilon": {"f": 0.0}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "data_format": {"s": "TkhXQw=="}, "padding": {"s": "VkFMSUQ="}}}, {"name": "StatefulPartitionedCall/sequential_2/conv1d_22/BiasAdd", "op": "Squeeze", "input": ["StatefulPartitionedCall/sequential_2/conv1d_22/conv1d"], "attr": {"T": {"type": "DT_FLOAT"}, "squeeze_dims": {"list": {"i": ["-3"]}}}}, {"name": "StatefulPartitionedCall/sequential_2/conv1d_22/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/sequential_2/conv1d_22/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_2/conv1d_23/Pad", "op": "Pad", "input": ["StatefulPartitionedCall/sequential_2/conv1d_22/Relu", "StatefulPartitionedCall/sequential_2/conv1d_23/Pad/paddings"], "attr": {"Tpaddings": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_2/conv1d_23/conv1d/ExpandDims", "op": "ExpandDims", "input": ["StatefulPartitionedCall/sequential_2/conv1d_23/Pad", "StatefulPartitionedCall/sequential_2/conv1d_23/conv1d/ExpandDims/dim"], "attr": {"T": {"type": "DT_FLOAT"}, "Tdim": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_2/conv1d_23/conv1d", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/sequential_2/conv1d_23/conv1d/ExpandDims", "StatefulPartitionedCall/sequential_2/conv1d_23/conv1d/ExpandDims_1", "StatefulPartitionedCall/sequential_2/conv1d_23/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}, "use_cudnn_on_gpu": {"b": true}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "padding": {"s": "VkFMSUQ="}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "num_args": {"i": "1"}, "explicit_paddings": {"list": {}}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/sequential_2/conv1d_23/BiasAdd", "op": "Squeeze", "input": ["StatefulPartitionedCall/sequential_2/conv1d_23/conv1d"], "attr": {"T": {"type": "DT_FLOAT"}, "squeeze_dims": {"list": {"i": ["-3"]}}}}, {"name": "StatefulPartitionedCall/sequential_2/conv1d_23/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/sequential_2/conv1d_23/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_2/max_pooling1d_11/ExpandDims", "op": "ExpandDims", "input": ["StatefulPartitionedCall/sequential_2/conv1d_23/Relu", "StatefulPartitionedCall/sequential_2/max_pooling1d_11/ExpandDims/dim"], "attr": {"T": {"type": "DT_FLOAT"}, "Tdim": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_2/max_pooling1d_11/MaxPool", "op": "MaxPool", "input": ["StatefulPartitionedCall/sequential_2/max_pooling1d_11/ExpandDims"], "attr": {"strides": {"list": {"i": ["1", "2", "1", "1"]}}, "ksize": {"list": {"i": ["1", "2", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "explicit_paddings": {"list": {}}, "padding": {"s": "VkFMSUQ="}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_2/max_pooling1d_11/Squeeze", "op": "Squeeze", "input": ["StatefulPartitionedCall/sequential_2/max_pooling1d_11/MaxPool"], "attr": {"squeeze_dims": {"list": {"i": ["2"]}}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_2/flatten_2/Reshape", "op": "Reshape", "input": ["StatefulPartitionedCall/sequential_2/max_pooling1d_11/Squeeze", "StatefulPartitionedCall/sequential_2/flatten_2/Const"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_2/dense_4/Relu", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/sequential_2/flatten_2/Reshape", "StatefulPartitionedCall/sequential_2/dense_4/MatMul/ReadVariableOp", "StatefulPartitionedCall/sequential_2/dense_4/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"T": {"type": "DT_FLOAT"}, "num_args": {"i": "1"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "transpose_a": {"b": false}, "epsilon": {"f": 0.0}, "transpose_b": {"b": false}}}, {"name": "StatefulPartitionedCall/sequential_2/dense_5/BiasAdd", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/sequential_2/dense_4/Relu", "StatefulPartitionedCall/sequential_2/dense_5/MatMul/ReadVariableOp", "StatefulPartitionedCall/sequential_2/dense_5/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "T": {"type": "DT_FLOAT"}, "num_args": {"i": "1"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "epsilon": {"f": 0.0}, "transpose_b": {"b": false}}}, {"name": "StatefulPartitionedCall/sequential_2/dense_5/Softmax", "op": "Softmax", "input": ["StatefulPartitionedCall/sequential_2/dense_5/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Identity", "op": "Identity", "input": ["StatefulPartitionedCall/sequential_2/dense_5/Softmax"], "attr": {"T": {"type": "DT_FLOAT"}}}], "library": {}, "versions": {"producer": 561}}, "weightsManifest": [{"paths": ["group1-shard1of2.bin", "group1-shard2of2.bin"], "weights": [{"name": "StatefulPartitionedCall/sequential_2/conv1d_16/Pad/paddings", "shape": [3, 2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential_2/conv1d_16/conv1d/ExpandDims/dim", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential_2/conv1d_16/conv1d/ExpandDims_1", "shape": [1, 7, 1, 32], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_2/conv1d_16/BiasAdd/ReadVariableOp", "shape": [32], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_2/conv1d_17/Pad/paddings", "shape": [3, 2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential_2/conv1d_17/conv1d/ExpandDims/dim", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential_2/conv1d_17/conv1d/ExpandDims_1", "shape": [1, 7, 32, 32], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_2/conv1d_17/BiasAdd/ReadVariableOp", "shape": [32], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_2/max_pooling1d_8/ExpandDims/dim", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential_2/conv1d_18/Pad/paddings", "shape": [3, 2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential_2/conv1d_18/conv1d/ExpandDims/dim", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential_2/conv1d_18/conv1d/ExpandDims_1", "shape": [1, 7, 32, 64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_2/conv1d_18/BiasAdd/ReadVariableOp", "shape": [64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_2/conv1d_19/Pad/paddings", "shape": [3, 2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential_2/conv1d_19/conv1d/ExpandDims/dim", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential_2/conv1d_19/conv1d/ExpandDims_1", "shape": [1, 7, 64, 64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_2/conv1d_19/BiasAdd/ReadVariableOp", "shape": [64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_2/max_pooling1d_9/ExpandDims/dim", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential_2/conv1d_20/Pad/paddings", "shape": [3, 2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential_2/conv1d_20/conv1d/ExpandDims/dim", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential_2/conv1d_20/conv1d/ExpandDims_1", "shape": [1, 7, 64, 128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_2/conv1d_20/BiasAdd/ReadVariableOp", "shape": [128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_2/conv1d_21/Pad/paddings", "shape": [3, 2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential_2/conv1d_21/conv1d/ExpandDims/dim", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential_2/conv1d_21/conv1d/ExpandDims_1", "shape": [1, 7, 128, 128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_2/conv1d_21/BiasAdd/ReadVariableOp", "shape": [128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_2/max_pooling1d_10/ExpandDims/dim", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential_2/conv1d_22/Pad/paddings", "shape": [3, 2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential_2/conv1d_22/conv1d/ExpandDims/dim", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential_2/conv1d_22/conv1d/ExpandDims_1", "shape": [1, 7, 128, 256], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_2/conv1d_22/BiasAdd/ReadVariableOp", "shape": [256], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_2/conv1d_23/Pad/paddings", "shape": [3, 2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential_2/conv1d_23/conv1d/ExpandDims/dim", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential_2/conv1d_23/conv1d/ExpandDims_1", "shape": [1, 7, 256, 256], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_2/conv1d_23/BiasAdd/ReadVariableOp", "shape": [256], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_2/max_pooling1d_11/ExpandDims/dim", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential_2/flatten_2/Const", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential_2/dense_4/MatMul/ReadVariableOp", "shape": [768, 512], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_2/dense_4/BiasAdd/ReadVariableOp", "shape": [512], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_2/dense_5/MatMul/ReadVariableOp", "shape": [512, 5], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_2/dense_5/BiasAdd/ReadVariableOp", "shape": [5], "dtype": "float32"}]}]}